<net batch="1" name="MobileNet-SSD" version="2">
	<layers>
		<layer id="1" name="data" precision="FP32" type="Input">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv0" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="32" pad-x="1" pad-y="1" stride-x="2" stride-y="2"/>
			<input>
				<port id="2">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<weights offset="0" size="3456"/>
			<biases offset="3456" size="128"/>
		</layer>
		<layer id="3" name="conv0_relu" precision="FP32" type="ReLU">
			<input>
				<port id="4">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv1_dw" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="32" kernel-x="3" kernel-y="3" output="32" pad-x="1" pad-y="1" stride-x="1" stride-y="1"/>
			<input>
				<port id="6">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="7">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<weights offset="3584" size="1152"/>
			<biases offset="4736" size="128"/>
		</layer>
		<layer id="5" name="conv1_dw_relu" precision="FP32" type="ReLU">
			<input>
				<port id="8">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="9">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv1" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="10">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="11">
					<dim>1</dim>
					<dim>64</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<weights offset="4864" size="8192"/>
			<biases offset="13056" size="256"/>
		</layer>
		<layer id="7" name="conv1_relu" precision="FP32" type="ReLU">
			<input>
				<port id="12">
					<dim>1</dim>
					<dim>64</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="13">
					<dim>1</dim>
					<dim>64</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv2_dw" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="64" kernel-x="3" kernel-y="3" output="64" pad-x="1" pad-y="1" stride-x="2" stride-y="2"/>
			<input>
				<port id="14">
					<dim>1</dim>
					<dim>64</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="15">
					<dim>1</dim>
					<dim>64</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
			<weights offset="13312" size="2304"/>
			<biases offset="15616" size="256"/>
		</layer>
		<layer id="9" name="conv2_dw_relu" precision="FP32" type="ReLU">
			<input>
				<port id="16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="17">
					<dim>1</dim>
					<dim>64</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv2" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="128" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="18">
					<dim>1</dim>
					<dim>64</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="19">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
			<weights offset="15872" size="32768"/>
			<biases offset="48640" size="512"/>
		</layer>
		<layer id="11" name="conv2_relu" precision="FP32" type="ReLU">
			<input>
				<port id="20">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="21">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv3_dw" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="128" kernel-x="3" kernel-y="3" output="128" pad-x="1" pad-y="1" stride-x="1" stride-y="1"/>
			<input>
				<port id="22">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="23">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
			<weights offset="49152" size="4608"/>
			<biases offset="53760" size="512"/>
		</layer>
		<layer id="13" name="conv3_dw_relu" precision="FP32" type="ReLU">
			<input>
				<port id="24">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="25">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="conv3" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="128" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="26">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="27">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
			<weights offset="54272" size="65536"/>
			<biases offset="119808" size="512"/>
		</layer>
		<layer id="15" name="conv3_relu" precision="FP32" type="ReLU">
			<input>
				<port id="28">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="29">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv4_dw" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="128" kernel-x="3" kernel-y="3" output="128" pad-x="1" pad-y="1" stride-x="2" stride-y="2"/>
			<input>
				<port id="30">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="31">
					<dim>1</dim>
					<dim>128</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<weights offset="120320" size="4608"/>
			<biases offset="124928" size="512"/>
		</layer>
		<layer id="17" name="conv4_dw_relu" precision="FP32" type="ReLU">
			<input>
				<port id="32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="33">
					<dim>1</dim>
					<dim>128</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv4" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="256" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="34">
					<dim>1</dim>
					<dim>128</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="35">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<weights offset="125440" size="131072"/>
			<biases offset="256512" size="1024"/>
		</layer>
		<layer id="19" name="conv4_relu" precision="FP32" type="ReLU">
			<input>
				<port id="36">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="37">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv5_dw" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="256" kernel-x="3" kernel-y="3" output="256" pad-x="1" pad-y="1" stride-x="1" stride-y="1"/>
			<input>
				<port id="38">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="39">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<weights offset="257536" size="9216"/>
			<biases offset="266752" size="1024"/>
		</layer>
		<layer id="21" name="conv5_dw_relu" precision="FP32" type="ReLU">
			<input>
				<port id="40">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="41">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="conv5" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="256" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="42">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="43">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<weights offset="267776" size="262144"/>
			<biases offset="529920" size="1024"/>
		</layer>
		<layer id="23" name="conv5_relu" precision="FP32" type="ReLU">
			<input>
				<port id="44">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="45">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="conv6_dw" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="256" kernel-x="3" kernel-y="3" output="256" pad-x="1" pad-y="1" stride-x="2" stride-y="2"/>
			<input>
				<port id="46">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="47">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
			<weights offset="530944" size="9216"/>
			<biases offset="540160" size="1024"/>
		</layer>
		<layer id="25" name="conv6_dw_relu" precision="FP32" type="ReLU">
			<input>
				<port id="48">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="49">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv6" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="512" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="50">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="51">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
			<weights offset="541184" size="524288"/>
			<biases offset="1065472" size="2048"/>
		</layer>
		<layer id="27" name="conv6_relu" precision="FP32" type="ReLU">
			<input>
				<port id="52">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="53">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="conv7_dw" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="512" kernel-x="3" kernel-y="3" output="512" pad-x="1" pad-y="1" stride-x="1" stride-y="1"/>
			<input>
				<port id="54">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="55">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
			<weights offset="1067520" size="18432"/>
			<biases offset="1085952" size="2048"/>
		</layer>
		<layer id="29" name="conv7_dw_relu" precision="FP32" type="ReLU">
			<input>
				<port id="56">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="57">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="conv7" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="512" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="58">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="59">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
			<weights offset="1088000" size="1048576"/>
			<biases offset="2136576" size="2048"/>
		</layer>
		<layer id="31" name="conv7_relu" precision="FP32" type="ReLU">
			<input>
				<port id="60">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="61">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv8_dw" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="512" kernel-x="3" kernel-y="3" output="512" pad-x="1" pad-y="1" stride-x="1" stride-y="1"/>
			<input>
				<port id="62">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="63">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
			<weights offset="2138624" size="18432"/>
			<biases offset="2157056" size="2048"/>
		</layer>
		<layer id="33" name="conv8_dw_relu" precision="FP32" type="ReLU">
			<input>
				<port id="64">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="65">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="conv8" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="512" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="66">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="67">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
			<weights offset="2159104" size="1048576"/>
			<biases offset="3207680" size="2048"/>
		</layer>
		<layer id="35" name="conv8_relu" precision="FP32" type="ReLU">
			<input>
				<port id="68">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="69">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv9_dw" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="512" kernel-x="3" kernel-y="3" output="512" pad-x="1" pad-y="1" stride-x="1" stride-y="1"/>
			<input>
				<port id="70">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="71">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
			<weights offset="3209728" size="18432"/>
			<biases offset="3228160" size="2048"/>
		</layer>
		<layer id="37" name="conv9_dw_relu" precision="FP32" type="ReLU">
			<input>
				<port id="72">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="73">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="conv9" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="512" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="74">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="75">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
			<weights offset="3230208" size="1048576"/>
			<biases offset="4278784" size="2048"/>
		</layer>
		<layer id="39" name="conv9_relu" precision="FP32" type="ReLU">
			<input>
				<port id="76">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="77">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv10_dw" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="512" kernel-x="3" kernel-y="3" output="512" pad-x="1" pad-y="1" stride-x="1" stride-y="1"/>
			<input>
				<port id="78">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="79">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
			<weights offset="4280832" size="18432"/>
			<biases offset="4299264" size="2048"/>
		</layer>
		<layer id="41" name="conv10_dw_relu" precision="FP32" type="ReLU">
			<input>
				<port id="80">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="81">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="conv10" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="512" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="82">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="83">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
			<weights offset="4301312" size="1048576"/>
			<biases offset="5349888" size="2048"/>
		</layer>
		<layer id="43" name="conv10_relu" precision="FP32" type="ReLU">
			<input>
				<port id="84">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="85">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="conv11_dw" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="512" kernel-x="3" kernel-y="3" output="512" pad-x="1" pad-y="1" stride-x="1" stride-y="1"/>
			<input>
				<port id="86">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="87">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
			<weights offset="5351936" size="18432"/>
			<biases offset="5370368" size="2048"/>
		</layer>
		<layer id="45" name="conv11_dw_relu" precision="FP32" type="ReLU">
			<input>
				<port id="88">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="89">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="conv11" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="512" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="90">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="91">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
			<weights offset="5372416" size="1048576"/>
			<biases offset="6420992" size="2048"/>
		</layer>
		<layer id="47" name="conv11_relu" precision="FP32" type="ReLU">
			<input>
				<port id="92">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="93">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="conv12_dw" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="512" kernel-x="3" kernel-y="3" output="512" pad-x="1" pad-y="1" stride-x="2" stride-y="2"/>
			<input>
				<port id="94">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="95">
					<dim>1</dim>
					<dim>512</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<weights offset="6423040" size="18432"/>
			<biases offset="6441472" size="2048"/>
		</layer>
		<layer id="49" name="conv12_dw_relu" precision="FP32" type="ReLU">
			<input>
				<port id="96">
					<dim>1</dim>
					<dim>512</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="97">
					<dim>1</dim>
					<dim>512</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="conv12" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="1024" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="98">
					<dim>1</dim>
					<dim>512</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="99">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<weights offset="6443520" size="2097152"/>
			<biases offset="8540672" size="4096"/>
		</layer>
		<layer id="51" name="conv12_relu" precision="FP32" type="ReLU">
			<input>
				<port id="100">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="101">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="conv13_dw" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1024" kernel-x="3" kernel-y="3" output="1024" pad-x="1" pad-y="1" stride-x="1" stride-y="1"/>
			<input>
				<port id="102">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="103">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<weights offset="8544768" size="36864"/>
			<biases offset="8581632" size="4096"/>
		</layer>
		<layer id="53" name="conv13_dw_relu" precision="FP32" type="ReLU">
			<input>
				<port id="104">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="105">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="conv13" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="1024" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="106">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="107">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<weights offset="8585728" size="4194304"/>
			<biases offset="12780032" size="4096"/>
		</layer>
		<layer id="55" name="conv13_relu" precision="FP32" type="ReLU">
			<input>
				<port id="108">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="109">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="conv14_1" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="256" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="110">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="111">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<weights offset="12784128" size="1048576"/>
			<biases offset="13832704" size="1024"/>
		</layer>
		<layer id="57" name="conv14_1_relu" precision="FP32" type="ReLU">
			<input>
				<port id="112">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="113">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="conv14_2" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="512" pad-x="1" pad-y="1" stride-x="2" stride-y="2"/>
			<input>
				<port id="114">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="115">
					<dim>1</dim>
					<dim>512</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</output>
			<weights offset="13833728" size="4718592"/>
			<biases offset="18552320" size="2048"/>
		</layer>
		<layer id="59" name="conv14_2_relu" precision="FP32" type="ReLU">
			<input>
				<port id="116">
					<dim>1</dim>
					<dim>512</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="117">
					<dim>1</dim>
					<dim>512</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="conv15_1" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="128" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="118">
					<dim>1</dim>
					<dim>512</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="119">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</output>
			<weights offset="18554368" size="262144"/>
			<biases offset="18816512" size="512"/>
		</layer>
		<layer id="61" name="conv15_1_relu" precision="FP32" type="ReLU">
			<input>
				<port id="120">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="121">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="conv15_2" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="256" pad-x="1" pad-y="1" stride-x="2" stride-y="2"/>
			<input>
				<port id="122">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="123">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<weights offset="18817024" size="1179648"/>
			<biases offset="19996672" size="1024"/>
		</layer>
		<layer id="63" name="conv15_2_relu" precision="FP32" type="ReLU">
			<input>
				<port id="124">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="125">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="conv16_1" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="128" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="126">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="127">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<weights offset="19997696" size="131072"/>
			<biases offset="20128768" size="512"/>
		</layer>
		<layer id="65" name="conv16_1_relu" precision="FP32" type="ReLU">
			<input>
				<port id="128">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="129">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="conv16_2" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="256" pad-x="1" pad-y="1" stride-x="2" stride-y="2"/>
			<input>
				<port id="130">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="131">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<weights offset="20129280" size="1179648"/>
			<biases offset="21308928" size="1024"/>
		</layer>
		<layer id="67" name="conv16_2_relu" precision="FP32" type="ReLU">
			<input>
				<port id="132">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="133">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="conv17_1" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="134">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="135">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<weights offset="21309952" size="65536"/>
			<biases offset="21375488" size="256"/>
		</layer>
		<layer id="69" name="conv17_1_relu" precision="FP32" type="ReLU">
			<input>
				<port id="136">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="137">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="conv17_2" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="128" pad-x="1" pad-y="1" stride-x="2" stride-y="2"/>
			<input>
				<port id="138">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="139">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<weights offset="21375744" size="294912"/>
			<biases offset="21670656" size="512"/>
		</layer>
		<layer id="71" name="conv17_2_relu" precision="FP32" type="ReLU">
			<input>
				<port id="140">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="141">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="conv11_mbox_loc" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="12" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="142">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="143">
					<dim>1</dim>
					<dim>12</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
			<weights offset="21671168" size="24576"/>
			<biases offset="21695744" size="48"/>
		</layer>
		<layer id="73" name="conv11_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="144">
					<dim>1</dim>
					<dim>12</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="145">
					<dim>1</dim>
					<dim>20</dim>
					<dim>20</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="conv11_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" dim="0" end_axis="-1" num_axes="0"/>
			<input>
				<port id="146">
					<dim>1</dim>
					<dim>20</dim>
					<dim>20</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="147">
					<dim>1</dim>
					<dim>4800</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="conv11_mbox_conf" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="63" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="148">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="149">
					<dim>1</dim>
					<dim>63</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
			<weights offset="21695792" size="129024"/>
			<biases offset="21824816" size="252"/>
		</layer>
		<layer id="76" name="conv11_mbox_conf_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="150">
					<dim>1</dim>
					<dim>63</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="151">
					<dim>1</dim>
					<dim>20</dim>
					<dim>20</dim>
					<dim>63</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="conv11_mbox_conf_flat" precision="FP32" type="Flatten">
			<data axis="1" dim="0" end_axis="-1" num_axes="0"/>
			<input>
				<port id="152">
					<dim>1</dim>
					<dim>20</dim>
					<dim>20</dim>
					<dim>63</dim>
				</port>
			</input>
			<output>
				<port id="153">
					<dim>1</dim>
					<dim>25200</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="conv11_mbox_priorbox" precision="FP32" type="PriorBox">
			<data aspect_ratio="2.0" clip="0" flip="1" img_h="0" img_size="0" img_w="0" max_size="" min_size="60" offset="0.5" step="15" step_h="0.0" step_w="0.0" variance="0.1,0.1,0.2,0.2"/>
			<input>
				<port id="154">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="155">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="156">
					<dim>1</dim>
					<dim>2</dim>
					<dim>4800</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="conv13_mbox_loc" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="24" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="157">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="158">
					<dim>1</dim>
					<dim>24</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<weights offset="21825068" size="98304"/>
			<biases offset="21923372" size="96"/>
		</layer>
		<layer id="80" name="conv13_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="159">
					<dim>1</dim>
					<dim>24</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="160">
					<dim>1</dim>
					<dim>10</dim>
					<dim>10</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="conv13_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" dim="0" end_axis="-1" num_axes="0"/>
			<input>
				<port id="161">
					<dim>1</dim>
					<dim>10</dim>
					<dim>10</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="162">
					<dim>1</dim>
					<dim>2400</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="conv13_mbox_conf" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="126" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="163">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="164">
					<dim>1</dim>
					<dim>126</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<weights offset="21923468" size="516096"/>
			<biases offset="22439564" size="504"/>
		</layer>
		<layer id="83" name="conv13_mbox_conf_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="165">
					<dim>1</dim>
					<dim>126</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="166">
					<dim>1</dim>
					<dim>10</dim>
					<dim>10</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="conv13_mbox_conf_flat" precision="FP32" type="Flatten">
			<data axis="1" dim="0" end_axis="-1" num_axes="0"/>
			<input>
				<port id="167">
					<dim>1</dim>
					<dim>10</dim>
					<dim>10</dim>
					<dim>126</dim>
				</port>
			</input>
			<output>
				<port id="168">
					<dim>1</dim>
					<dim>12600</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="conv13_mbox_priorbox" precision="FP32" type="PriorBox">
			<data aspect_ratio="2.0,3.0" clip="0" flip="1" img_h="0" img_size="0" img_w="0" max_size="150" min_size="105" offset="0.5" step="30" step_h="0.0" step_w="0.0" variance="0.1,0.1,0.2,0.2"/>
			<input>
				<port id="169">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
				<port id="170">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="171">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2400</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="conv14_2_mbox_loc" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="24" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="172">
					<dim>1</dim>
					<dim>512</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="173">
					<dim>1</dim>
					<dim>24</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</output>
			<weights offset="22440068" size="49152"/>
			<biases offset="22489220" size="96"/>
		</layer>
		<layer id="87" name="conv14_2_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="174">
					<dim>1</dim>
					<dim>24</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="175">
					<dim>1</dim>
					<dim>6</dim>
					<dim>6</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv14_2_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" dim="0" end_axis="-1" num_axes="0"/>
			<input>
				<port id="176">
					<dim>1</dim>
					<dim>6</dim>
					<dim>6</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="177">
					<dim>1</dim>
					<dim>864</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="conv14_2_mbox_conf" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="126" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="178">
					<dim>1</dim>
					<dim>512</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="179">
					<dim>1</dim>
					<dim>126</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</output>
			<weights offset="22489316" size="258048"/>
			<biases offset="22747364" size="504"/>
		</layer>
		<layer id="90" name="conv14_2_mbox_conf_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="180">
					<dim>1</dim>
					<dim>126</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="181">
					<dim>1</dim>
					<dim>6</dim>
					<dim>6</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="conv14_2_mbox_conf_flat" precision="FP32" type="Flatten">
			<data axis="1" dim="0" end_axis="-1" num_axes="0"/>
			<input>
				<port id="182">
					<dim>1</dim>
					<dim>6</dim>
					<dim>6</dim>
					<dim>126</dim>
				</port>
			</input>
			<output>
				<port id="183">
					<dim>1</dim>
					<dim>4536</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="conv14_2_mbox_priorbox" precision="FP32" type="PriorBox">
			<data aspect_ratio="2.0,3.0" clip="0" flip="1" img_h="0" img_size="0" img_w="0" max_size="195" min_size="150" offset="0.5" step="50" step_h="0.0" step_w="0.0" variance="0.1,0.1,0.2,0.2"/>
			<input>
				<port id="184">
					<dim>1</dim>
					<dim>512</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
				<port id="185">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="186">
					<dim>1</dim>
					<dim>2</dim>
					<dim>864</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="conv15_2_mbox_loc" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="24" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="187">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="188">
					<dim>1</dim>
					<dim>24</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<weights offset="22747868" size="24576"/>
			<biases offset="22772444" size="96"/>
		</layer>
		<layer id="94" name="conv15_2_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="189">
					<dim>1</dim>
					<dim>24</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="190">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="conv15_2_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" dim="0" end_axis="-1" num_axes="0"/>
			<input>
				<port id="191">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="192">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="conv15_2_mbox_conf" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="126" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="193">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="194">
					<dim>1</dim>
					<dim>126</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<weights offset="22772540" size="129024"/>
			<biases offset="22901564" size="504"/>
		</layer>
		<layer id="97" name="conv15_2_mbox_conf_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="195">
					<dim>1</dim>
					<dim>126</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="196">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="conv15_2_mbox_conf_flat" precision="FP32" type="Flatten">
			<data axis="1" dim="0" end_axis="-1" num_axes="0"/>
			<input>
				<port id="197">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>126</dim>
				</port>
			</input>
			<output>
				<port id="198">
					<dim>1</dim>
					<dim>2016</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="conv15_2_mbox_priorbox" precision="FP32" type="PriorBox">
			<data aspect_ratio="2.0,3.0" clip="0" flip="1" img_h="0" img_size="0" img_w="0" max_size="240" min_size="195" offset="0.5" step="75" step_h="0.0" step_w="0.0" variance="0.1,0.1,0.2,0.2"/>
			<input>
				<port id="199">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="200">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="201">
					<dim>1</dim>
					<dim>2</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="conv16_2_mbox_loc" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="24" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="202">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="203">
					<dim>1</dim>
					<dim>24</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<weights offset="22902068" size="24576"/>
			<biases offset="22926644" size="96"/>
		</layer>
		<layer id="101" name="conv16_2_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="204">
					<dim>1</dim>
					<dim>24</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="205">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="conv16_2_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" dim="0" end_axis="-1" num_axes="0"/>
			<input>
				<port id="206">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="207">
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="conv16_2_mbox_conf" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="126" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="208">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="209">
					<dim>1</dim>
					<dim>126</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<weights offset="22926740" size="129024"/>
			<biases offset="23055764" size="504"/>
		</layer>
		<layer id="104" name="conv16_2_mbox_conf_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="210">
					<dim>1</dim>
					<dim>126</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="211">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="conv16_2_mbox_conf_flat" precision="FP32" type="Flatten">
			<data axis="1" dim="0" end_axis="-1" num_axes="0"/>
			<input>
				<port id="212">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>126</dim>
				</port>
			</input>
			<output>
				<port id="213">
					<dim>1</dim>
					<dim>504</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="conv16_2_mbox_priorbox" precision="FP32" type="PriorBox">
			<data aspect_ratio="2.0,3.0" clip="0" flip="1" img_h="0" img_size="0" img_w="0" max_size="285" min_size="240" offset="0.5" step="150" step_h="0.0" step_w="0.0" variance="0.1,0.1,0.2,0.2"/>
			<input>
				<port id="214">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="215">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="216">
					<dim>1</dim>
					<dim>2</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="conv17_2_mbox_loc" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="24" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="217">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="218">
					<dim>1</dim>
					<dim>24</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<weights offset="23056268" size="12288"/>
			<biases offset="23068556" size="96"/>
		</layer>
		<layer id="108" name="conv17_2_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="219">
					<dim>1</dim>
					<dim>24</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="220">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="conv17_2_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" dim="0" end_axis="-1" num_axes="0"/>
			<input>
				<port id="221">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="222">
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="conv17_2_mbox_conf" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="126" pad-x="0" pad-y="0" stride-x="1" stride-y="1"/>
			<input>
				<port id="223">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="224">
					<dim>1</dim>
