<net name="SSD_ResNet18_FP16" version="2" batch="1">
    <layers>
        <layer name="input" type="Input" precision="FP16" id="0">
            <output>
                <port id="0">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>300</dim>
                    <dim>300</dim>
                </port>
            </output>
        </layer>
        <layer name="conv1" type="Convolution" precision="FP16" id="1">
            <convolution_data stride-x="2" stride-y="2" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="64" group="1"/>
            <input>
                <port id="1">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>300</dim>
                    <dim>300</dim>
                </port>
            </input>
            <output>
                <port id="2">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>150</dim>
                    <dim>150</dim>
                </port>
            </output>
            <weights offset="0" size="18816"/>
            <biases offset="18816" size="128"/>
        </layer>
        <layer name="conv1_relu" type="ReLU" precision="FP16" id="4">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="7">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>150</dim>
                    <dim>150</dim>
                </port>
            </input>
            <output>
                <port id="8">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>150</dim>
                    <dim>150</dim>
                </port>
            </output>
        </layer>
        <layer name="pool1" type="Pooling" precision="FP16" id="5">
            <pooling_data kernel-x="3" kernel-y="3" pad-x="0" pad-y="0" stride-x="2" stride-y="2" rounding-type="ceil" pool-method="max"/>
            <input>
                <port id="9">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>150</dim>
                    <dim>150</dim>
                </port>
            </input>
            <output>
                <port id="10">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="res2a_branch2a" type="Convolution" precision="FP16" id="9">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1"/>
            <input>
                <port id="17">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="18">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="18944" size="73728"/>
            <biases offset="92672" size="128"/>
        </layer>
        <layer name="res2a_branch2a_relu" type="ReLU" precision="FP16" id="12">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="23">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="24">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="res2a_branch2b" type="Convolution" precision="FP16" id="13">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1"/>
            <input>
                <port id="25">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="26">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="92800" size="73728"/>
            <biases offset="166528" size="128"/>
        </layer>
        <layer name="res2a_branch2b_relu" type="ReLU" precision="FP16" id="16">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="31">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="32">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="res2a_branch1" type="Convolution" precision="FP16" id="6">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="11">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="12">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="166656" size="8192"/>
            <biases offset="174848" size="128"/>
        </layer>
        <layer name="res2a" type="Eltwise" precision="FP16" id="17">
            <elementwise_data operation="sum"/>
            <input>
                <port id="33">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
                <port id="34">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="35">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="res2a_relu" type="ReLU" precision="FP16" id="18">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="36">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="37">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="res2b_branch2a" type="Convolution" precision="FP16" id="19">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1"/>
            <input>
                <port id="38">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="39">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="174976" size="73728"/>
            <biases offset="248704" size="128"/>
        </layer>
        <layer name="res2b_branch2a_relu" type="ReLU" precision="FP16" id="22">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="44">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="45">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="res2b_branch2b" type="Convolution" precision="FP16" id="23">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1"/>
            <input>
                <port id="46">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="47">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="248832" size="73728"/>
            <biases offset="322560" size="128"/>
        </layer>
        <layer name="res2b_branch2b_relu" type="ReLU" precision="FP16" id="26">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="52">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="53">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="res2b" type="Eltwise" precision="FP16" id="27">
            <elementwise_data operation="sum"/>
            <input>
                <port id="54">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
                <port id="55">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="56">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="res2b_relu" type="ReLU" precision="FP16" id="28">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="57">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="58">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="res3a_branch2a" type="Convolution" precision="FP16" id="32">
            <convolution_data stride-x="2" stride-y="2" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="65">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="66">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="322688" size="147456"/>
            <biases offset="470144" size="256"/>
        </layer>
        <layer name="res3a_branch2a_relu" type="ReLU" precision="FP16" id="35">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="71">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="72">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="res3a_branch2b" type="Convolution" precision="FP16" id="36">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="73">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="74">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="470400" size="294912"/>
            <biases offset="765312" size="256"/>
        </layer>
        <layer name="res3a_branch2b_relu" type="ReLU" precision="FP16" id="39">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="79">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="80">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="res3a_branch1" type="Convolution" precision="FP16" id="29">
            <convolution_data stride-x="2" stride-y="2" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
            <input>
                <port id="59">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="60">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="765568" size="16384"/>
            <biases offset="781952" size="256"/>
        </layer>
        <layer name="res3a" type="Eltwise" precision="FP16" id="40">
            <elementwise_data operation="sum"/>
            <input>
                <port id="81">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
                <port id="82">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="83">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="res3a_relu" type="ReLU" precision="FP16" id="41">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="84">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="85">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="res3a_relu_mbox_priorbox" type="PriorBox" precision="FP16" id="129">
            <data min_size="30.000000" max_size="" aspect_ratio="2.000000" flip="1" clip="1" variance="0.100000,0.100000,0.200000,0.200000" img_size="0" img_h="0" img_w="0" step="0.000000" step_h="0.000000" step_w="0.000000" offset="0.500000" width="" height=""/>
            <input>
                <port id="265">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
                <port id="266">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>300</dim>
                    <dim>300</dim>
                </port>
            </input>
            <output>
                <port id="267">
                    <dim>1</dim>
                    <dim>2</dim>
                    <dim>17328</dim>
                </port>
            </output>
        </layer>
        <layer name="res3a_relu_mbox_conf" type="Convolution" precision="FP16" id="126">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="63" group="1"/>
            <input>
                <port id="259">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="260">
                    <dim>1</dim>
                    <dim>63</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="782208" size="145152"/>
            <biases offset="927360" size="126"/>
        </layer>
        <layer name="res3a_relu_mbox_conf_perm" type="Permute" precision="FP16" id="127">
            <data order="0,2,3,1"/>
            <input>
                <port id="261">
                    <dim>1</dim>
                    <dim>63</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="262">
                    <dim>1</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                    <dim>63</dim>
                </port>
            </output>
        </layer>
        <layer name="res3a_relu_mbox_conf_flat" type="Flatten" precision="FP16" id="128">
            <data axis="1" end_axis="-1"/>
            <input>
                <port id="263">
                    <dim>1</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                    <dim>63</dim>
                </port>
            </input>
            <output>
                <port id="264">
                    <dim>1</dim>
                    <dim>90972</dim>
                </port>
            </output>
        </layer>
        <layer name="res3a_relu_mbox_loc" type="Convolution" precision="FP16" id="123">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="12" group="1"/>
            <input>
                <port id="253">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="254">
                    <dim>1</dim>
                    <dim>12</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="927486" size="27648"/>
            <biases offset="955134" size="24"/>
        </layer>
        <layer name="res3a_relu_mbox_loc_perm" type="Permute" precision="FP16" id="124">
            <data order="0,2,3,1"/>
            <input>
                <port id="255">
                    <dim>1</dim>
                    <dim>12</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="256">
                    <dim>1</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="res3a_relu_mbox_loc_flat" type="Flatten" precision="FP16" id="125">
            <data axis="1" end_axis="-1"/>
            <input>
                <port id="257">
                    <dim>1</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="258">
                    <dim>1</dim>
                    <dim>17328</dim>
                </port>
            </output>
        </layer>
        <layer name="res3b_branch2a" type="Convolution" precision="FP16" id="42">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="86">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="87">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="955158" size="294912"/>
            <biases offset="1250070" size="256"/>
        </layer>
        <layer name="res3b_branch2a_relu" type="ReLU" precision="FP16" id="45">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="92">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="93">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="res3b_branch2b" type="Convolution" precision="FP16" id="46">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="94">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="95">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="1250326" size="294912"/>
            <biases offset="1545238" size="256"/>
        </layer>
        <layer name="res3b_branch2b_relu" type="ReLU" precision="FP16" id="49">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="100">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="101">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="res3b" type="Eltwise" precision="FP16" id="50">
            <elementwise_data operation="sum"/>
            <input>
                <port id="102">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
                <port id="103">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="104">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="res3b_relu" type="ReLU" precision="FP16" id="51">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="105">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="106">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="res4a_branch2a" type="Convolution" precision="FP16" id="55">
            <convolution_data stride-x="2" stride-y="2" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1"/>
            <input>
                <port id="113">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="114">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
            <weights offset="1545494" size="589824"/>
            <biases offset="2135318" size="512"/>
        </layer>
        <layer name="res4a_branch2a_relu" type="ReLU" precision="FP16" id="58">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="119">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="120">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="res4a_branch2b" type="Convolution" precision="FP16" id="59">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1"/>
            <input>
                <port id="121">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="122">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
            <weights offset="2135830" size="1179648"/>
            <biases offset="3315478" size="512"/>
        </layer>
        <layer name="res4a_branch2b_relu" type="ReLU" precision="FP16" id="62">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="127">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="128">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="res4a_branch1" type="Convolution" precision="FP16" id="52">
            <convolution_data stride-x="2" stride-y="2" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
            <input>
                <port id="107">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="108">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
            <weights offset="3315990" size="65536"/>
            <biases offset="3381526" size="512"/>
        </layer>
        <layer name="res4a" type="Eltwise" precision="FP16" id="63">
            <elementwise_data operation="sum"/>
            <input>
                <port id="129">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
                <port id="130">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="131">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="res4a_relu" type="ReLU" precision="FP16" id="64">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="132">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="133">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="res4b_branch2a" type="Convolution" precision="FP16" id="65">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1"/>
            <input>
                <port id="134">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="135">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
            <weights offset="3382038" size="1179648"/>
            <biases offset="4561686" size="512"/>
        </layer>
        <layer name="res4b_branch2a_relu" type="ReLU" precision="FP16" id="68">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="140">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="141">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="res4b_branch2b" type="Convolution" precision="FP16" id="69">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1"/>
            <input>
                <port id="142">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="143">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
            <weights offset="4562198" size="1179648"/>
            <biases offset="5741846" size="512"/>
        </layer>
        <layer name="res4b_branch2b_relu" type="ReLU" precision="FP16" id="72">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="148">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="149">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="res4b" type="Eltwise" precision="FP16" id="73">
            <elementwise_data operation="sum"/>
            <input>
                <port id="150">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
                <port id="151">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="152">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="res4b_relu" type="ReLU" precision="FP16" id="74">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="153">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="154">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="res5a_branch2a" type="Convolution" precision="FP16" id="78">
            <convolution_data stride-x="2" stride-y="2" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="512" group="1"/>
            <input>
                <port id="161">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="162">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </output>
            <weights offset="5742358" size="2359296"/>
            <biases offset="8101654" size="1024"/>
        </layer>
        <layer name="res5a_branch2a_relu" type="ReLU" precision="FP16" id="81">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="167">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </input>
            <output>
                <port id="168">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </output>
        </layer>
        <layer name="res5a_branch2b" type="Convolution" precision="FP16" id="82">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="512" group="1"/>
            <input>
                <port id="169">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </input>
            <output>
                <port id="170">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </output>
            <weights offset="8102678" size="4718592"/>
            <biases offset="12821270" size="1024"/>
        </layer>
        <layer name="res5a_branch2b_relu" type="ReLU" precision="FP16" id="85">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="175">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </input>
            <output>
                <port id="176">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </output>
        </layer>
        <layer name="res5a_branch1" type="Convolution" precision="FP16" id="75">
            <convolution_data stride-x="2" stride-y="2" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1"/>
            <input>
                <port id="155">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="156">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </output>
            <weights offset="12822294" size="262144"/>
            <biases offset="13084438" size="1024"/>
        </layer>
        <layer name="res5a" type="Eltwise" precision="FP16" id="86">
            <elementwise_data operation="sum"/>
            <input>
                <port id="177">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
                <port id="178">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </input>
            <output>
                <port id="179">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </output>
        </layer>
        <layer name="res5a_relu" type="ReLU" precision="FP16" id="87">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="180">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </input>
            <output>
                <port id="181">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </output>
        </layer>
        <layer name="res5b_branch2a" type="Convolution" precision="FP16" id="88">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="512" group="1"/>
            <input>
                <port id="182">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </input>
            <output>
                <port id="183">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </output>
            <weights offset="13085462" size="4718592"/>
            <biases offset="17804054" size="1024"/>
        </layer>
        <layer name="res5b_branch2a_relu" type="ReLU" precision="FP16" id="91">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="188">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </input>
            <output>
                <port id="189">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </output>
        </layer>
        <layer name="res5b_branch2b" type="Convolution" precision="FP16" id="92">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="512" group="1"/>
            <input>
                <port id="190">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </input>
            <output>
                <port id="191">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </output>
            <weights offset="17805078" size="4718592"/>
            <biases offset="22523670" size="1024"/>
        </layer>
        <layer name="res5b_branch2b_relu" type="ReLU" precision="FP16" id="95">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="196">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </input>
            <output>
                <port id="197">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </output>
        </layer>
        <layer name="res5b" type="Eltwise" precision="FP16" id="96">
            <elementwise_data operation="sum"/>
            <input>
                <port id="198">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
                <port id="199">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </input>
            <output>
                <port id="200">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </output>
        </layer>
        <layer name="res5b_relu" type="ReLU" precision="FP16" id="97">
            <data negative_slope="0.000000" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="201">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </input>
            <output>
                <port id="202">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </output>
        </layer>
        <layer name="res5b_relu_mbox_priorbox" type="PriorBox" precision="FP16" id="136">
            <data min_size="60.000000" max_size="114.000000" aspect_ratio="2.000000,3.000000" flip="1" clip="1" variance="0.100000,0.100000,0.200000,0.200000" img_size="0" img_h="0" img_w="0" step="0.000000" step_h="0.000000" step_w="0.000000" offset="0.500000" width="" height=""/>
            <input>
                <port id="280">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
                <port id="281">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>300</dim>
                    <dim>300</dim>
                </port>
            </input>
            <output>
                <port id="282">
                    <dim>1</dim>
                    <dim>2</dim>
                    <dim>2400</dim>
                </port>
            </output>
        </layer>
        <layer name="res5b_relu_mbox_conf" type="Convolution" precision="FP16" id="133">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="126" group="1"/>
            <input>
                <port id="274">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </input>
            <output>
                <port id="275">
                    <dim>1</dim>
                    <dim>126</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </output>
            <weights offset="22524694" size="1161216"/>
            <biases offset="23685910" size="252"/>
        </layer>
        <layer name="res5b_relu_mbox_conf_perm" type="Permute" precision="FP16" id="134">
            <data order="0,2,3,1"/>
            <input>
                <port id="276">
                    <dim>1</dim>
                    <dim>126</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </input>
            <output>
                <port id="277">
                    <dim>1</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                    <dim>126</dim>
                </port>
            </output>
        </layer>
        <layer name="res5b_relu_mbox_conf_flat" type="Flatten" precision="FP16" id="135">
            <data axis="1" end_axis="-1"/>
            <input>
                <port id="278">
                    <dim>1</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                    <dim>126</dim>
                </port>
            </input>
            <output>
                <port id="279">
                    <dim>1</dim>
                    <dim>12600</dim>
                </port>
            </output>
        </layer>
        <layer name="res5b_relu_mbox_loc" type="Convolution" precision="FP16" id="130">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="24" group="1"/>
            <input>
                <port id="268">
                    <dim>1</dim>
                    <dim>512</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </input>
            <output>
                <port id="269">
                    <dim>1</dim>
                    <dim>24</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </output>
            <weights offset="23686162" size="221184"/>
            <biases offset="23907346" size="48"/>
        </layer>
        <layer name="res5b_relu_mbox_loc_perm" type="Permute" precision="FP16" id="131">
            <data order="0,2,3,1"/>
            <input>
                <port id="270">
                    <dim>1</dim>
                    <dim>24</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                </port>
            </input>
            <output>
                <port id="271">
                    <dim>1</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                    <dim>24</dim>
                </port>
            </output>
        </layer>
        <layer name="res5b_relu_mbox_loc_flat" type="Flatten" precision="FP16" id="132">
            <data axis="1" end_axis="-1"/>
            <input>
                <port id="272">
                    <dim>1</dim>
                    <dim>10</dim>
                    <dim>10</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="273">
                    <dim>1</dim>
                    <dim>2400</dim>
                </port>
